# adobe-acrobat-reader
# alfred
# appcleaner
# bartender
# battle-net
# beardedspice
# betterzip
# caffeine
# cheatsheet
# cyberduck
# dash
# discord
# docker
# dropbox
# endurance
# eve
# eve-launcher
# evernote
# firefox
# flash-player
# flux
font-droidsansmono-nerd-font-mono
font-fira-code
font-fira-mono
font-fira-sans
font-firacode-nerd-font-mono
font-firamono-nerd-font-mono
font-hack
font-hack-nerd-font
font-hack-nerd-font-mono
font-inconsolata-g-for-powerline
font-input
font-lato
font-lora
font-merriweather
font-montserrat
font-noto-sans
font-noto-sans-mono
font-office-code-pro
font-open-sans
font-open-sans-condensed
font-pt-sans
font-raleway
font-roboto
font-roboto-condensed
font-roboto-slab
font-robotomono-nerd-font-mono
font-source-code-pro
font-source-code-pro-for-powerline
font-source-sans-pro
font-source-serif-pro
font-ubuntu-nerd-font
font-ubuntu-nerd-font-mono
font-ubuntumono-nerd-font
font-ubuntumono-nerd-font-mono
# forklift
# franz
# gitkraken
# google-chrome
# hammerspoon
! inkscape
# insomnia
# iterm2
# jadengeller-helium
# karabiner-elements
! lando
! launchrocket
# league-of-legends
# local-by-flywheel
# logitech-gaming-software
# logitech-options
# logitech-unifying
# macdown
# mumble
# now
# nvidia-geforce-now
# phpstorm
# postman
# private-internet-access
# qlcolorcode
# qlimagesize
# qlmarkdown
# qlstephen
# qlvideo
# quicklook-json
# screenflow
# sequel-pro
# shuttle
# silverlight
# sketch
# skitch
# slack
# spectacle
# spotify
# steam
! sublime-text
# suspicious-package
# the-unarchiver
# transmission
# transmit
# vagrant
# virtualbox
# visual-studio-code
# vlc
# webpquicklook
! xquartz
# zoomus
