# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-drivers'
tap "mongodb/brew"

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'bat'
brew 'ccat'
brew 'composer'
brew 'diff-so-fancy'
brew 'exa'
brew 'fasd'
brew 'gifify'
brew 'git'
brew 'git-flow'
brew 'highlight'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'lnav'
brew 'mackup'
brew 'mas'
brew 'mcrypt'
brew 'mkcert'
brew 'nano'
brew 'nginx'
brew 'node'
brew 'p7zip'
brew 'peco'
brew 'ssh-copy-id'
brew 'thefuck'
brew 'tidy-html5'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'unar'
brew 'wget'
brew 'wifi-password'
brew 'yarn'

# Development
brew 'ansible'
brew 'dnsmasq'
brew 'php'
brew 'php@7.3'
brew 'pre-commit'
brew 'pyenv' # rbenv/tap/openssl@1.0 needed for older python versions
brew 'mariadb'
brew 'terminal-notifier'
brew 'wp-cli'

# Apps
cask '1password'
cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'beardedspice'
cask 'docker'
cask 'caffeine'
cask 'cheatsheet'
cask 'dash'
cask 'endurance'
cask 'eve'
cask 'evernote'
cask 'firefox'
cask 'flash-player'
cask 'flux'
cask 'forklift'
cask 'google-chrome'
cask 'hammerspoon'
cask 'hyper'
cask 'iglance'
cask 'insomnia'
cask 'iterm2'
cask 'karabiner-elements'
cask 'macdown'
cask 'mongodb-compass-community'
cask 'muzzle'
cask 'postman'
cask 'private-internet-access'
cask 'screenflow'
cask 'sequel-pro-nightly'
cask 'shuttle'
cask 'silverlight'
cask 'sketch'
cask 'skitch'
cask 'slack'
cask 'spacelauncher'
cask 'spectacle'
cask 'spotify'
cask 'there'
cask 'transmission'
cask 'ui-browser'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoomus'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'qlimagesize'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Install Mac App Store apps
mas "Dato", id: 1470584107
mas "Fantastical", id: 975937182
#mas "Frank DeLoupe", id: 530458789
mas "GIPHY CAPTURE", id: 668208984
mas 'Kaleidoscope', id: 587512244
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Redacted", id: 984968384
mas "Xcode", id: 497799835
mas 'Yoink', id: 457622435

# Install these last due to unattended issues
cask 'virtualbox' # will fail :(
cask 'logitech-gaming-software'
cask 'logitech-options'
cask 'vagrant'
cask 'vagrant-manager'
