# install zsh-nvm first so node is available elsewhere
lukechilds/zsh-nvm

# this block is in alphabetic order
caarlos0/ports kind:path
caarlos0/zsh-mkc
DarrinTisdale/zsh-aliases-exa
gko/ssh-connect
hlissner/zsh-autopair
buonomo/yarn-completion
marzocchi/zsh-notify
michaelxmcbride/zsh-dircycle
molovo/tipz
peterhurford/git-it-on.zsh
zdharma/zsh-diff-so-fancy
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions

# these should be at last!
lukechilds/zsh-better-npm-completion
zdharma/fast-syntax-highlighting
zsh-users/zsh-history-substring-search
