# Fonts
cask 'font-cascadia'
cask 'font-droidsansmono-nerd-font-mono'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-firacode-nerd-font-mono'
cask 'font-firamono-nerd-font-mono'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-hack-nerd-font-mono'
cask 'font-inconsolata-g-for-powerline'
cask 'font-input'
cask 'font-lato'
cask 'font-lora'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-noto-sans'
cask 'font-noto-sans-mono'
cask 'font-office-code-pro'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-pt-sans'
cask 'font-raleway'
cask 'font-roboto'
cask 'font-roboto-condensed'
#cask 'font-roboto-slab'
cask 'font-robotomono-nerd-font-mono'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-ubuntu-nerd-font'
cask 'font-ubuntu-nerd-font-mono'
cask 'font-ubuntumono-nerd-font'
cask 'font-ubuntumono-nerd-font-mono'
